#pragma once
#include <string.h>
#include <stdlib.h>
#include <iostream>
#include <string>
using namespace std;

// XBOX 360 SDK NOTICE:
// 
// TPKTool is capable of untiling of the textures without the XDK
// However of course, this means it's (probably) not as good as the official solution
// On the other hand, this makes it less cross-platform compatible
// This is one thing I am planning to remove eventually and is only temporary
// until we figure out how to make mipmaps untile better!
// 
// Testing differences show mipmap extraction being a bit better using XDK!
#ifdef TPKTOOL_XDK
#include <Windows.h>
#include <d3d9.h>
#include "xgraphics.h"
#endif

#define DDS_MAGIC 0x20534444

#define TPKCAPSULE_CHUNKID 0xB3300000
#define TPK_CHUNKID 0xB3310000
#define TPKDATA_CHUNKID 0xB3320000
#define TPK_CHILD1_CHUNKID 0x33310001
#define TPK_CHILD2_CHUNKID 0x33310002
#define TPK_CHILD3_CHUNKID 0x33310003
#define TPK_CHILD4_CHUNKID 0x33310004
#define TPK_CHILD5_CHUNKID 0x33310005

#define TPK_EXTRACAPSULE_CHUNKID 0xB3312000
#define TPK_ANIM_CHUNKID 0xB3312004
#define TPK_ANIMCHILD1_CHUNKID 0x33312001
#define TPK_ANIMCHILD2_CHUNKID 0x33312002

#define TPKDATA_CHILD1_CHUNKID 0x33320001
#define TPKDATA_CHILD2_CHUNKID 0x33320002
#define TPKDATA_CHILD3_CHUNKID 0x33320003

#define TEXTURENUMCHANNELS 4
#define TPK_TYPENAME_SIZE 0x1C
#define TPK_PATHNAME_SIZE 0x40

#define SIZEOF_TPK_CHILD1 0x7C
#define SIZEOF_TPK_DATA_CHILD1 0x18

// 360 supports TPK minver 5 (TPKv4 as I called it here, version detection will be added at a later point)
#define TPKTOOL_READINGMODE_PLAT_V2_360 4
#define TPKTOOL_WRITINGMODE_PLAT_V2_360 4
#define TPKTOOL_READINGMODE_PLAT_360 5
#define TPKTOOL_WRITINGMODE_PLAT_360 5

#define TPKTOOL_READINGMODE_PLAT_PS2 6
#define TPKTOOL_WRITINGMODE_PLAT_PS2 6
#define TPKTOOL_READINGMODE_PLAT_V2_PS2 7
#define TPKTOOL_WRITINGMODE_PLAT_V2_PS2 7

#define TPKTOOL_READINGMODE_PLAT_XBOX 8
#define TPKTOOL_WRITINGMODE_PLAT_XBOX 8

#define TPKTOOL_READINGMODE_PLAT_WII 9
#define TPKTOOL_WRITINGMODE_PLAT_WII 9

#define TPK_COMPRESSION_TYPE_RGBA 0x20
#define TPK_COMPRESSION_TYPE_DXT1 0x22
#define TPK_COMPRESSION_TYPE_DXT3 0x24
#define TPK_COMPRESSION_TYPE_DXT5 0x26
#define TPK_COMPRESSION_TYPE_P8 8

#define TPKTOOL_HELPMESSAGE "\
Usage: [-w/-h/-?] InFile [OutFile]\n\n\
Default: InFile = TPK file | OutFile = Output folder path\n\
-2     : TPK v4- mode (UG2 & MW), InFile = TPK file | OutFile = Output folder path\n\
-PS2   : PS2 mode (TPK v5+), InFile = TPK file | OutFile = Output folder path\n\
-PS2-2 : PS2 mode (TPK v4-), InFile = TPK file | OutFile = Output folder path\n\
-PS3   : PS3 mode (TPK v5+ only), InFile = TPK file | OutFile = Output folder path\n\
-360   : 360 mode (TPK v5+), InFile = TPK file | OutFile = Output folder path\n\
-360-2 : 360 mode (TPK v4-), InFile = TPK file | OutFile = Output folder path\n\
-XBX   : Xbox mode, InFile = TPK file | OutFile = Output folder path\n\
-w     : Writing mode (TPK v5+), InFile = TPK settings ini file | OutFile = Output file name\n\
-w2    : Writing mode (TPK v4-), InFile = TPK settings ini file | OutFile = Output file name\n\
-wPS2  : Writing mode (PS2 TPK v5+), InFile = TPK settings ini file | OutFile = Output file name\n\
-wPS2-2: Writing mode (PS2 TPK v4-), InFile = TPK settings ini file | OutFile = Output file name\n\
-wPS3  : Writing mode (PS3 TPK v5+), InFile = TPK settings ini file | OutFile = Output file name\n\
-w360  : Writing mode (360 TPK v5+), InFile = TPK settings ini file | OutFile = Output file name\n\
-w360-2: Writing mode (360 TPK v4-), InFile = TPK settings ini file | OutFile = Output file name\n\
-wXBX  : Writing mode (Xbox TPK v5+), InFile = TPK settings ini file | OutFile = Output file name\n\
-h/-?  : Show this help message\n\
[OutFile] optional, if not specified, the folder will be created with the filename's base\n\
\nDDS files are extracted to their respective TPK hash directory.\n\
Compressed TPKs are NOT fully supported yet.\n\
All games except World are currently supported!\n\
While this tool can extract data for other platforms, it only fully works with PC! Console support WIP!"

#define PRINTTYPE_ERROR "ERROR:"
#define PRINTTYPE_INFO "INFO:"
#define PRINTTYPE_WARNING "WARNING:"

int ReadingMode = 0;
int WritingMode = 0;
bool bCompressed = 0;

#define FOURCC_DXT1 0x31545844
#define FOURCC_DXT3 0x33545844
#define FOURCC_DXT5 0x35545844
#define FOURCC_ATI2 0x32495441
#define FOURCC_ARGB 0x15

struct GamePixelFormatStruct // temporary storage for unknown stuff
{
	unsigned int FourCC;
	unsigned int Unknown1;
	unsigned int Unknown2;
	unsigned int Unknown3;
	unsigned int Unknown4;
	unsigned int Unknown5;
};

struct TPKChild5Struct_PS3
{
	unsigned char Unknown1[8];
	unsigned int PixelFormatVal1; // DXT1 = 0, DXT5 = 1, RGBA = 1, DXT3 = unknown, P8 = unknown
	unsigned char SomeVal1; // 2
	unsigned char SomeVal2; // 3
	unsigned short int Unknown2; // 0
	unsigned char PixelFormatVal2; // DXT1 = 3, DXT5 = 3, RGBA = 1, DXT3 = unknown, P8 = unknown
	unsigned char PixelFormatVal3; // DXT1 = 3, DXT5 = 3, RGBA = 0, DXT3 = unknown, P8 = unknown
	unsigned char Unknown3[0x1A]; // all = 0
};

// also used on Carbon it seems...
//struct TPKChild5Struct_v2_360
//{
//	unsigned char Unknown1[8];
//	unsigned int PixelFormatVal1; // 1
//	unsigned int SomeVal1; // 6 = DXT5
//	unsigned int SomeVal2; // 1 = DXT5, ARGB, DXT3, 7 = ARGB or some other RGB?
//	unsigned char SomeVal3;
//	bool bSwizzled;
//	unsigned short SomeVal4;
//	//unsigned int SomeVal3; // 0x1A200154 = DXT5, 0x18280186 = RGBA, 0x1A200152 = DXT1, 0x1A200153 = DXT3, maybe not 32 bits, simplified for the sake of testing
//	unsigned char Unknown2[8];
//};

// new version...
struct TPKChild5Struct_v2_360
{
	unsigned char Unknown1[8];
	unsigned int PixelFormatVal1;
	unsigned int SomeVal1;
	unsigned int SomeVal2;
	unsigned int D3DFormat; // D3DFMT in big endian...
	//bool bSwizzled;
	//unsigned short SomeVal4;
	//unsigned int SomeVal3; // 0x1A200154 = DXT5, 0x18280186 = RGBA, 0x1A200152 = DXT1, 0x1A200153 = DXT3, maybe not 32 bits, simplified for the sake of testing
	unsigned char Unknown2[8];
};

struct TPKChild5Struct_Xbox // TODO - decipher pixel format stuff
{
	//unsigned char Unknown1[0x3C];
	unsigned int unk1; // usually 1
	unsigned int unk2; // usually 0x302
	unsigned int unk3; // this is different between 2 same DXT3 files... 0x303 on one DXT3 file, 1 on another, then on a DXT1 file it's 0x303 again... I have no idea.
	unsigned int PixelFormat; // 0xE = DXT3, 0xC = DXT1, 0xB = P8, 0x6 = ARGB, DXT5 unknown
	unsigned char unk4[0x2C]; // unknown space
};

struct GamePixelFormatStruct_v2 // temporary storage for unknown stuff
{
	unsigned int Unknown1;
	unsigned int Unknown2;
	unsigned int Unknown3; // sometimes 1
	unsigned int Unknown4; // mostly 5
	unsigned int Unknown5; // mostly 6, sometimes 2
	unsigned int FourCC;
	unsigned int Unknown6;
	unsigned int Unknown7;
};

struct TPKLinkStruct
{
	unsigned int NumberOfTPKs;
	unsigned int TPKHash[255]; // can go up to int max but decided against it since this feature is unused
	unsigned int Unknown1;
	unsigned int Unknown2;
	unsigned int Unknown3;
	unsigned int Unknown4;
};

struct TPKAnimStruct
{
	unsigned int Unknown1;
	unsigned int Unknown2;
	char Name[0x10];
	unsigned int Hash;
	unsigned char Frames;
	unsigned char Framerate;
	unsigned short int Unknown3;
	unsigned int Unknown4;
	unsigned int Unknown5;
	unsigned int Unknown6;
};

struct TPKChild3Struct
{
	unsigned int TextureHash;
	unsigned int AbsoluteOffset;
	unsigned int Size;
	unsigned int OutSize;
	unsigned int FromEndToHeaderOffset;
	unsigned int unk;
	//unsigned int Unknown[3];
};

struct TPKChild3_v2_Struct
{
	uint32_t TextureHash;
	uint32_t AbsoluteOffset;
	uint32_t Size;
	uint32_t OutSize;
	uint32_t FromEndToHeaderOffset;
};

struct CompressBlockHead
{
	unsigned int CompressBlockMagic; // = 0x55441122
	unsigned int OutSize; // =0x8000
	unsigned int TotalBlockSize;
	unsigned int Unknown2; // += OutSize
	unsigned int Unknown3; // += TotalBlockSize
	unsigned int Unknown4;
};

struct JDLZhead
{
	uint32_t CompressBlockMagic;
	uint32_t unk1;
	uint32_t OutSize;
	uint32_t InSize;
};

struct TPK_v4_Child4Struct // World
{
	unsigned int Unknown13[3];
	unsigned int Hash;
	unsigned int Hash2;
	unsigned int Hash3;
	unsigned int DataOffset;
	unsigned int Unknown14;
	unsigned int DataSize;
	unsigned int Unknown1;
	unsigned int Scaler;
	unsigned short int ResX;
	unsigned short int ResY;
	unsigned char UnkByteVal1;
	unsigned char UnkByteVal2;
	unsigned short int Unknown3;
	unsigned char Unknown17;
	unsigned char Unknown18;
	unsigned char MipmapCount;
	unsigned char UnkByteVal3;
	unsigned int Unknown4;
	unsigned int Unknown5; // affects color blending modes
	unsigned int Unknown6;
	unsigned int Unknown7;
	unsigned int Unknown8;
	unsigned int Unknown9;
	unsigned int Unknown10;
	unsigned int Unknown11;
	unsigned int Unknown12;
};

/*struct TPKChild4Struct
{
	unsigned int Unknown13[3];
	unsigned int Hash;
	unsigned int Hash2;
	unsigned int DataOffset;
	unsigned int Unknown14;
	unsigned int DataSize;
	unsigned int Unknown1;
	unsigned int Scaler;
	unsigned short int ResX;
	unsigned short int ResY;
	unsigned char UnkByteVal1;
	unsigned char UnkByteVal2;
	unsigned short int Unknown3;
	unsigned char Unknown17;
	unsigned char Unknown18;
	unsigned char MipmapCount;
	unsigned char UnkByteVal3;
	unsigned int Unknown4;
	unsigned int Unknown5; // affects color blending modes
	unsigned int Unknown6;
	unsigned int Unknown7;
	unsigned int Unknown8;
	unsigned int Unknown9;
	unsigned int Unknown10;
	unsigned int Unknown11;
	unsigned int Unknown12;
};

struct TPKChild4Struct_TPKv4
{
	unsigned int Unknown13[3];
	char TexName[0x18];
	unsigned int Hash;
	unsigned int Hash2;
	unsigned int unk1;
	unsigned int DataOffset;
	unsigned int Unknown14;
	unsigned int DataSize;
	unsigned int Unknown1;
	unsigned int Scaler;
	unsigned short int ResX;
	unsigned short int ResY;
	unsigned char UnkByteVal1;
	unsigned char UnkByteVal2;
	unsigned short int Unknown3;
	unsigned char Unknown17;
	unsigned char Unknown18;
	unsigned char MipmapCount;
	unsigned char UnkByteVal3;
	unsigned int Unknown4;
	unsigned int Unknown5;
	unsigned int Unknown6;
	unsigned int Unknown7;
	unsigned int Unknown8;
	unsigned int Unknown9;
	unsigned int Unknown10; // zeroes from here
	unsigned int Unknown11;
	unsigned int Unknown12;
	unsigned int Unknown15;
	unsigned int Unknown16;
};*/

struct TextureInfo
{
	unsigned int Unknown;
	long Padding_990[2];
	unsigned int NameHash;
	unsigned int ClassNameHash;
	int ImagePlacement;
	int PalettePlacement;
	int ImageSize;
	int PaletteSize;
	int BaseImageSize;
	short Width;
	short Height;
	char ShiftWidth;
	char ShiftHeight;
	unsigned char ImageCompressionType; // 0x20 = RGB, 0x22 = DXT1, 0x24 = DXT3, 0x26 = DXT5, 0x8 = P8
	unsigned char PaletteCompressionType;
	short NumPaletteEntries;
	char NumMipMapLevels;
	char TilableUV;
	char BiasLevel;
	char RenderingOrder;
	char ScrollType;
	char UsedFlag;
	char ApplyAlphaSorting;
	char AlphaUsageType;
	char AlphaBlendType;
	char Flags;
	//char MipmapBiasType;
	//char Padding;
	short ScrollTimeStep;
	short ScrollSpeedS;
	short ScrollSpeedT;
	short OffsetS;
	short OffsetT;
	short ScaleS;
	short ScaleT;
	uint8_t other[0xE];
	//class TexturePack* pTexturePack;
	//void* ImageData;
	//void* PaletteData;
	//char DebugNameSize;
	//char DebugName[35];
};

struct OldTextureInfo
{
	unsigned int Unknown;
	long Padding_990[2];
	char DebugName[24];
	unsigned int NameHash;
	unsigned int ClassNameHash;
	unsigned int Unknown2;
	int ImagePlacement;
	int PalettePlacement;
	int ImageSize;
	int PaletteSize;
	int BaseImageSize;
	short Width;
	short Height;
	char ShiftWidth;
	char ShiftHeight;
	unsigned char ImageCompressionType;
	unsigned char PaletteCompressionType;
	short NumPaletteEntries;
	char NumMipMapLevels;
	char TilableUV;
	char BiasLevel;
	char RenderingOrder;
	char ScrollType;
	char UsedFlag;
	char ApplyAlphaSorting;
/*0x55*/char AlphaUsageType;
/*0x56*/char AlphaBlendType;
/*0x57*/char Flags;
/*0x58*/char MipmapBiasType;
/*0x59*/char Unknown3;
/*0x5A*/short ScrollTimeStep;
/*0x5C*/	short ScrollSpeedS;
/*0x5E*/	short ScrollSpeedT;
/*0x60*/	short OffsetS;
/*0x62*/	short OffsetT;
/*0x64*/	short ScaleS;
/*0x66*/	short ScaleT;
/*0x68*/	class TexturePack* pTexturePack;
/*0x6C*/	void* ImageData;
/*0x70*/	void* PaletteData;
unsigned int Unknown4[2];
	//char DebugNameSize;
	//char DebugName[35];
};

struct TexturePackHeader
{
	int Version;
	char Name[28];
	char Filename[64];
	unsigned int FilenameHash;
	unsigned int PermChunkByteOffset;
	unsigned int PermChunkByteSize;
	int EndianSwapped;
	class TexturePack* pTexturePack;
	class TextureIndexEntry* TextureIndexEntryTable;
	class eStreamingEntry* TextureStreamEntryTable;
};

struct TexStruct
{
	//TPKChild4Struct Child4;
	TextureInfo Child4;
	bool bSwizzled;
	char TexName[255];
	char FilesystemPath[255];
};

// a structure to encompass internally used variables to reduce text clutter during argument passing
// MEMORY LEAK! very hacky ATM, needs fixing ASAP
struct TPKToolInternalStruct
{
	unsigned int TPKTypeValue;
	char TPKTypeName[TPK_TYPENAME_SIZE];
	char TPKPathName[TPK_PATHNAME_SIZE];
	char StatFileName[32];
	char SettingsFileName[32];
	char OutputPath[1024];
	char TotalFilePath[1024];
